In [3]:
#https://codeshare.io/zyMOnj
import pandas as pd

In [4]:
data=pd.read_excel('Match.xlsx')

In [5]:
data.head(2)

,Match_Id,Match_Date,Team_Name_Id,Opponent_Team_Id,Season_Id,Venue_Name,Toss_Winner_Id,Toss_Decision,IS_Superover,IS_Result,Is_DuckWorthLewis,Win_Type,Won_By,Match_Winner_Id,Man_Of_The_Match_Id,First_Umpire_Id,Second_Umpire_Id,City_Name,Host_Country
0,335987,2008-04-18,2,1,1,M Chinnaswamy Stadium,2,field,0,1,0,by runs,140.0,1.0,2.0,470,477,Bangalore,India
1,335988,2008-04-19,4,3,1,"Punjab Cricket Association Stadium, Mohali",3,bat,0,1,0,by runs,33.0,3.0,19.0,471,487,Chandigarh,India

In [6]:
#How many matches playes as per this dataset in IPL ?
len(data)

577

In [7]:
data['Match_Id'].nunique()

577

In [11]:
#How many matches won by CSK
len(data[data['Match_Winner_Id']==3])

79

In [12]:
data['Win_Type'].unique()

array(['by runs', 'by wickets', 'Tie', 'No Result'], dtype=object)

In [15]:
#How many matches CSK won by Chasing ?
len(data[(data['Match_Winner_Id']==3) & (data['Win_Type']=='by wickets')])

33

In [16]:
#How many matches CSK won by Chasing ?
len(data[(data['Match_Winner_Id']==3) & (data['Win_Type']=='by runs')])

46

In [22]:
#Winning Percentage of CSK
tot_csk=((data['Team_Name_Id']==3) | (data['Opponent_Team_Id']==3)).sum()

win_csk=(data['Match_Winner_Id']==3).sum()

win_csk/tot_csk*100

60.30534351145038

7.0     80
3.0     79
2.0     70
1.0     68
5.0     63
4.0     63
6.0     56
11.0    34
8.0     29
10.0    12
13.0     9
9.0      6
12.0     5
Name: Match_Winner_Id, dtype: int64

In [24]:
data.head(2)

,Match_Id,Match_Date,Team_Name_Id,Opponent_Team_Id,Season_Id,Venue_Name,Toss_Winner_Id,Toss_Decision,IS_Superover,IS_Result,Is_DuckWorthLewis,Win_Type,Won_By,Match_Winner_Id,Man_Of_The_Match_Id,First_Umpire_Id,Second_Umpire_Id,City_Name,Host_Country
0,335987,2008-04-18,2,1,1,M Chinnaswamy Stadium,2,field,0,1,0,by runs,140.0,1.0,2.0,470,477,Bangalore,India
1,335988,2008-04-19,4,3,1,"Punjab Cricket Association Stadium, Mohali",3,bat,0,1,0,by runs,33.0,3.0,19.0,471,487,Chandigarh,India

In [25]:
data['Team_Name_Id']

0       2
1       4
2       6
3       7
4       1
       ..
572     6
573    13
574    11
575    13
576     2
Name: Team_Name_Id, Length: 577, dtype: int64

In [26]:
type(data)

pandas.core.frame.DataFrame

In [27]:
type(data['Team_Name_Id'])

pandas.core.series.Series

In [28]:
type(data[['Team_Name_Id','Match_Date']])

pandas.core.frame.DataFrame

In [31]:
win_count=data['Match_Winner_Id'].value_counts()
win_count

7.0     80
3.0     79
2.0     70
1.0     68
5.0     63
4.0     63
6.0     56
11.0    34
8.0     29
10.0    12
13.0     9
9.0      6
12.0     5
Name: Match_Winner_Id, dtype: int64

In [32]:
pd.DataFrame(win_count)

      Match_Winner_Id
7.0                80
3.0                79
2.0                70
1.0                68
5.0                63
4.0                63
6.0                56
11.0               34
8.0                29
10.0               12
13.0                9
9.0                 6
12.0                5

In [35]:
#win_count.reset_index(drop=True)
win_count=win_count.reset_index()

In [37]:
win_count.columns=['Team_ID','Win_Match_Count']

In [39]:
#win_count

In [42]:
tot_count=data['Team_Name_Id'].value_counts()+data['Opponent_Team_Id'].value_counts()

In [43]:
tot_count=tot_count.reset_index()

In [45]:
tot_count.columns=['Team_ID','Total_Matches']
tot_count

    Team_ID  Total_Matches
0         1            132
1         2            139
2         3            131
3         4            134
4         5            118
5         6            133
6         7            140
7         8             75
8         9             14
9        10             46
10       11             62
11       12             14
12       13             16

In [51]:
win_count=win_count.sort_values('Team_ID',ascending=True)

In [55]:
tot_count.head(3)

   Team_ID  Total_Matches
0        1            132
1        2            139
2        3            131

In [56]:
win_count.head(3)

   Team_ID  Win_Match_Count
3      1.0               68
2      2.0               70
1      3.0               79

In [58]:
win_count=win_count.reset_index(drop=True)

In [59]:
win_count.head(3)

   Team_ID  Win_Match_Count
0      1.0               68
1      2.0               70
2      3.0               79

In [77]:
tab=pd.concat([tot_count,win_count],axis=1)
#tab=tab.drop('Team_ID',axis=1)
#tab

In [73]:
tab=tab.iloc[:,[0,1,3]]

In [75]:
tab['Win_Percentage']=tab['Win_Match_Count']/
                                     tab['Total_Matches']

In [76]:
tab

    Team_ID  Total_Matches  Win_Match_Count  Win_Percentage
0         1            132               68        0.515152
1         2            139               70        0.503597
2         3            131               79        0.603053
3         4            134               63        0.470149
4         5            118               63        0.533898
5         6            133               56        0.421053
6         7            140               80        0.571429
7         8             75               29        0.386667
8         9             14                6        0.428571
9        10             46               12        0.260870
10       11             62               34        0.548387
11       12             14                5        0.357143
12       13             16                9        0.562500

In [80]:
seas=pd.read_excel('Season.xlsx')

In [82]:
player=pd.read_excel('Player.xlsx')

In [87]:
mer_res=pd.merge(left=seas,right=player,how='inner',
         left_on='Orange_Cap_Id',right_on='Player_Id')

In [88]:
mer_res.head(5)

,Season_Id,Season_Year,Orange_Cap_Id,Purple_Cap_Id,Man_of_the_Series_Id,Player_Id,Player_Name,DOB,Batting_Hand,Bowling_Skill,Country,Is_Umpire,Unnamed: 7
0,1,2008,100,102,32,100,SE Marsh,1983-07-09,Left_Hand,Slow left-arm orthodox,Australia,0,NaN
1,2,2009,18,61,53,18,ML Hayden,1971-10-29,Left_Hand,Right-arm medium,Australia,0,NaN
2,3,2010,133,131,133,133,SR Tendulkar,1973-04-24,Right_Hand,Right-arm offbreak,India,0,NaN
3,4,2011,162,194,162,162,CH Gayle,1979-09-21,Left_Hand,Right-arm offbreak,West Indies,0,NaN
4,5,2012,162,190,315,162,CH Gayle,1979-09-21,Left_Hand,Right-arm offbreak,West Indies,0,NaN

In [89]:
mer_res[['Season_Year','Player_Name']]

   Season_Year   Player_Name
0         2008      SE Marsh
1         2009     ML Hayden
2         2010  SR Tendulkar
3         2011      CH Gayle
4         2012      CH Gayle
5         2013    MEK Hussey
6         2014    RV Uthappa
7         2015     DA Warner
8         2016       V Kohli